original/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    location    "0";
    format      ascii;
    class       volScalarField;
    object      T;
}
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters.cs"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T;

boundaryField
{


    "(sides|outlet|inlet)"
    {
        type            inletOutlet;
        gamma           1.4;
        inletValue      uniform $T;
        value           uniform $T;

    }

    rocket
    {
        type        zeroGradient;
        value           uniform $T;

    }
}

// ************************************************************************* //
