original/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters.cs"

dimensions      [0 1 -1 0 0 0 0];




alpha   #calc "$AoA * 3.14159265358979323846 / 180.0"; // 10 degrees in radians

a       #calc "sqrt($gamma * $R * $T)";
U       #calc "$Ma * $a";

Ux      409;//#calc "$U * cos($alpha * 1.0)";
Uy      5;//#calc "$U * sin($alpha * 1.0)";
Uz      5;




internalField   uniform ($Ux $Uy $Uz);

boundaryField
{
    "(sides|outlet|inlet)"
    {
        type            freestreamVelocity;
        pInf            $P;
        TInf            $T;
        UInf            ($Ux $Uy $Uz);
        gamma           1.4;
        value           uniform ($Ux $Uy $Uz);
        freestreamValue           uniform ($Ux $Uy $Uz);
    }

    rocket
    {
        type            noSlip;
    }
}

// ************************************************************************* //
