original/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-5; // calculates how fast turbulent kinetic energy is dissipated into heat.

boundaryField
{
    "(sides|outlet|inlet)"
    {
        type            freestream;
        freestreamValue uniform 1e-5;
        value           uniform 1e-5;
    }
    rocket
    {
        type            epsilonWallFunction;
        value           uniform 1e-12;
    }
}


// ************************************************************************* //
