original/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters.cs"

dimensions      [0 2 -2 0 0 0 0];

k 0.01;


internalField   uniform $k;

boundaryField
{

    "(sides|outlet|inlet)"
    {
        //type            freestream;
        type            inletOutlet;
        inletValue      uniform $k;
        freestreamValue      uniform $k;
        value           uniform $k;

    }
    rocket
    {
        type            kqRWallFunction;
        value           uniform $k;
    }
}


// ************************************************************************* //
