original/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../parameters.cs"


dimensions      [0 2 -1 0 0 0 0];

nut 0.0;


internalField   uniform 0.0;

boundaryField
{
    "(sides|outlet|inlet)"
    {
        type            calculated;
	value           uniform $nut;
    }
    rocket
    {
        type            nutkWallFunction;
        value           uniform $nut;
    }
}


// ************************************************************************* //
