original/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

#include "../parameters.cs"


omega 10;

internalField   uniform $omega;

boundaryField
{
    "(sides|outlet|inlet)"
    {
        //type                    freestream;
        type                    inletOutlet;
        inletValue              uniform $omega;
        freestreamValue         uniform $omega;
        value                   uniform $omega;
    }
    rocket
    {
        type            omegaWallFunction;
        value           uniform $omega;

    }
}


// ************************************************************************* //
