original/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
    location    "0";
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#include "../parameters.cs"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $P;

boundaryField
{
    "(sides|outlet|inlet)"
    {
    type            freestreamPressure;
    freestreamValue uniform $P;
    }

    rocket
    {
        type            zeroGradient;
	value           uniform $P;
    }
    
}

// ************************************************************************* //
