original/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


limitTemperature
{
    type        limitTemperature;
    active      true;
    limitTemperatureCoeffs
    {
        selectionMode   all;          // Applies to all cells
        min            100;          // Minimum temperature in Kelvin
        max            6000;          // Maximum temperature in Kelvin
    }
}
