original/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters.cs"

surfaceFile "constant/triSurface/combined.fms";
//surfaceFile "geometry/combined.stl";




maxCellSize $maxCellSize;
symmetryPlaneLayerTopology	0;
meshMultipleDomainsAndBaffles	0;
nCellsBetweenLevels	4;
domainDefinition
{
    convertAllPatchesToFaceZones	1;
    detachPointsAtAllInternalPatches	0;
    domainNames	();
    generateMeshInAllDomains	1;
}

edgeMeshRefinement
{
    edges
    {
        edgeFile "constant/triSurface/rocketPractice.eMesh";
        //edgeFile "constant/triSurface/rocket.eMesh";


        additionalRefinementLevels    9;
    }
}
localRefinement
{
    rocket
    {
        additionalRefinementLevels	7;
        //cellSize #calc "$firstLayerThickness * 10.0";
        refinementThickness 0.1;
    }

}

objectRefinements
{

    box0
    {
        type box;
        //cellSize #calc "$maxCellSize / 2.0";
        additionalRefinementLevels	1;
        centre (4.5 0 0);
        lengthX 16;
        lengthY 4;
        lengthZ 4;
    }
    box1
    {
        type box;
        //cellSize #calc "$maxCellSize / 2.0";
        additionalRefinementLevels	2;
        centre (3.5 0 0);
        lengthX 13;
        lengthY 3;
        lengthZ 3;
    }
    
    box2
    {
        type box;
        //cellSize #calc "$maxCellSize / 4.0";
        additionalRefinementLevels	3;

        centre (2.5 0 0);
        lengthX 10;
        lengthY 2;
        lengthZ 2;
    }
    box3
    {
        type box;
        //cellSize #calc "$maxCellSize / 8.0";
        additionalRefinementLevels	4;
        centre (1.5 0 0);
        lengthX 7;
        lengthY 1;
        lengthZ 1;
    }
    box4
    {
        type box;
        //cellSize #calc "$maxCellSize / 8.0";
        additionalRefinementLevels	5;
        centre (1.4 0 0);
        lengthX 5.4;
        lengthY 0.6;
        lengthZ 0.6;
    }


}

boundaryLayers
{
    patchBoundaryLayers
    {
        rocket
        {
            nLayers 7;
            thicknessRatio 1.2;
            //maxFirstLayerThickness $firstLayerThickness;

            allowDiscontinuity 0;
        }
    }

    optimiseLayer true;

    optimisationParameters
    {
        nSmoothNormals 10;
        maxNumIterations 20;
        featureSizeFactor 0.4;
        reCalculateNormals true;
        relThicknessTol 0.1;
        
    }
}

renameBoundary
{
    patchBoundaryLayers
    {
        inlet
        {
             type            patch;
        }
        outlet
        {
            type            patch;    
        }
        sides
        {
            type            patch;    
        }
        rocket
        {
            type            wall;
        }
    }
}



// ************************************************************************* //